app/views/books/index.html.erb

						<%= link_to book_favorites_path(book), method: :delete do %>
							<i class="glyphicon glyphicon-heart"><%= book.favorites.count%></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]

					<% else %><%= link_to book_favorites_path(book), method: :post do %>
						<i class="glyphicon glyphicon-heart-empty"><%= book.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]