app/views/books/show.html.erb

						<%= link_to book_favorites_path(@book_post), method: :delete do %>
							<i class="glyphicon glyphicon-heart"><%= @book_post.favorites.count%></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

					<% else %><%= link_to book_favorites_path(@book_post), method: :post do %>
						<i class="glyphicon glyphicon-heart-empty"><%= @book_post.favorites.count %></i>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

				<td>
					<p>コメント数 : <%= @book_post.book_comments.count %></p>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]


		<p><%= @book_post.book_comments.count %>件のコメント</p>
			<table class="table">
				<% @book_post.book_comments.each do |book_comment| %>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]