app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "bb"], ["body", "b"], ["user_id", 2], ["created_at", "2020-05-03 05:44:54.451211"], ["updated_at", "2020-05-03 05:44:54.451211"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
    if @book.save #入力されたデータをdbに保存する。
      redirect_to book_path(@book.id), notice: "successfully created book!"#保存された場合の移動先を指定。
    else
      @books = Book.all